In [5]:
import os
import datetime
import shutil
import pandas as pd

In [6]:
##Enter Server Details
model_server = "files\modelServer\etc\\"
new_server = "files\\newServer\etc\\"

In [7]:
##Taking backup of original File Model Server
file = input("Enter file to copy (without extention): ")
original_file = new_server + file + ".txt"
file_name, file_extension = os.path.splitext(original_file)
new_file = file_name + '_NEW_' + datetime.datetime.now().strftime("%Y-%m-%d") + file_extension
backup_file = file_name + '_BKP' + datetime.datetime.now().strftime("%Y-%m-%d") + file_extension
shutil.copy(original_file, backup_file)
print("Backup created:",backup_file)

Enter file to copy (without extention): group
Backup created: files\newServer\etc\group_BKP2024-02-27.txt

In [20]:
sdf = pd.read_csv('files\modelServer\etc\group.txt', sep=':', header=None)
sdf

            0         1    2                          3
0        root     sdvsd  100                        NaN
1      unixsa  asdvasdv  101  nkumar10,draj,rrai,ksharm
2    oracledb   sdvasdv  102                abc,abd,abg
3  storageops    ssfeww  103       mganes,ysanam,jmitha
4        info     qwqew  104                  ravi,jitu
5         aaa    aedweu  105                        NaN

In [21]:
ndf = pd.read_csv("files\modelServer\etc\group1.txt", sep=':', header=None)
ndf

            0         1    2                     3
0        root     sdvsd  100                   NaN
1      unixsa  asdvasdv  101                   NaN
2    oracledb   sdvasdv  102           abc,abd,abg
3  storageops    ssfeww  103  mganes,ysanam,jmitha
4        engg   asaewwe  107        ahegde,saryaop

In [26]:
# Find common columns and indices
common_cols = sdf.columns.intersection(ndf.columns)
common_idx = ndf.index.intersection(ndf.index)
common_idx

RangeIndex(start=0, stop=5, step=1)

In [46]:
all_values = pd.concat([sdf[0], ndf[0]]).unique()
all_values

array(['root', 'unixsa', 'oracledb', 'storageops', 'info', 'aaa', 'engg'],
      dtype=object)

In [47]:
merged_df = pd.DataFrame(index=all_values)
merged_df

Empty DataFrame
Columns: []
Index: [root, unixsa, oracledb, storageops, info, aaa, engg]

In [54]:
# Join DataFrames based on the first column using outer join
result = ndf.merge(sdf, on=0, how='outer')
result

,0,1_x,2_x,3_x,1_y,2_y,3_y
0,root,sdvsd,100.0,NaN,sdvsd,100.0,NaN
1,unixsa,asdvasdv,101.0,NaN,asdvasdv,101.0,"nkumar10,draj,rrai,ksharm"
2,oracledb,sdvasdv,102.0,"abc,abd,abg",sdvasdv,102.0,"abc,abd,abg"
3,storageops,ssfeww,103.0,"mganes,ysanam,jmitha",ssfeww,103.0,"mganes,ysanam,jmitha"
4,engg,asaewwe,107.0,"ahegde,saryaop",NaN,NaN,NaN
5,info,NaN,NaN,NaN,qwqew,104.0,"ravi,jitu"
6,aaa,NaN,NaN,NaN,aedweu,105.0,NaN

In [55]:
user_data1 = [
    {"username": "user1", "uid": 1000, "gid": 100, "info": "User One"},
    {"username": "user2", "uid": 1001, "gid": 100, "info": "User Two"},
]

user_data2 = [
    {"username": "user1", "uid": 1000, "gid": 100},
    {"username": "user3", "uid": 1002, "gid": 101, "info": "User Three"},
]

In [68]:
usernames1 = set([user["username"] for user in user_data1])
usernames2 = set([user["username"] for user in user_data2])
usernames2

{'user1', 'user3'}

In [67]:
missing_in_1 = usernames2 - usernames1
missing_in_2 = usernames1 - usernames2
missing_in_2

{'user2'}

In [69]:
complete_data = {}
for user in user_data1:
    complete_data[user["username"]] = user

for user in user_data2:
    if user["username"] not in complete_data:
        complete_data[user["username"]] = user
complete_data

{'user1': {'username': 'user1', 'uid': 1000, 'gid': 100, 'info': 'User One'},
 'user2': {'username': 'user2', 'uid': 1001, 'gid': 100, 'info': 'User Two'},
 'user3': {'username': 'user3', 'uid': 1002, 'gid': 101, 'info': 'User Three'}}

In [61]:
filled_user_data2 = []
for user in user_data2:
    if user["username"] in missing_in_2:
        filled_user_data2.append(complete_data[user["username"]])
    else:
        filled_user_data2.append(user)

In [62]:
complete_data = {}
for user in user_data1:
    complete_data[user["username"]] = user

for user in user_data2:
    if user["username"] not in complete_data:
        complete_data[user["username"]] = user

In [63]:
filled_user_data2 = []
for user in user_data2:
    if user["username"] in missing_in_2:
        filled_user_data2.append(complete_data[user["username"]])
    else:
        filled_user_data2.append(user)

In [64]:
print("Filled User Data 2:")
for user in filled_user_data2:
    print(user)

Filled User Data 2:
{'username': 'user1', 'uid': 1000, 'gid': 100}
{'username': 'user3', 'uid': 1002, 'gid': 101, 'info': 'User Three'}

In [65]:
filled_user_data2

[{'username': 'user1', 'uid': 1000, 'gid': 100},
 {'username': 'user3', 'uid': 1002, 'gid': 101, 'info': 'User Three'}]